RWebQuest/soap-log.txt_checkStatus_request.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <n1:checkStatus xmlns:n1="http://webservice.siquest.villanova.edu/siQuestSOAP/">
      <token>Rails</token>
      <uploadDir>C:/Users/Tarun/Documents/CSC9010</uploadDir>
    </n1:checkStatus>
  </env:Body>
</env:Envelope>