RWebQuest/soap-log.txt_getQuery_request.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <n1:getQuery xmlns:n1="http://webservice.siquest.villanova.edu/siQuestSOAP/">
      <filename>C:/Users/Tarun/Documents/CSC9010/GOS_data.pdf</filename>
      <analyzer></analyzer>
      <searchService>GOOGLE</searchService>
    </n1:getQuery>
  </env:Body>
</env:Envelope>